QuantumLeaps/3rd_party/nucleo-h533re/arm/startup_stm32h533retx.s
;*****************************************************************************
; @file     startup_stm32h533retx.s for ARM-KEIL ARM assembler
; @brief    CMSIS Cortex-M33 Core Device Startup File for tm32h533ret
; @date     23 Jun 2026
;
; Modified by Quantum Leaps:
; - Modified all exception handlers to branch to assert_failed()
;   instead of locking up the CPU inside an endless loop.
;
; @description
; Created from the CMSIS template for the specified device
; Quantum Leaps, www.state-machine.com
;
; @note
; The symbols Stack_Size and Heap_Size should be provided on the command-
; line options to the assembler, for example as:
;     --pd "Stack_Size SETA 1024" --pd "Heap_Size SETA 0"


;******************************************************************************
; Allocate space for the stack.
;
        AREA    STACK, NOINIT, READWRITE, ALIGN=3
__stack_base
StackMem
        SPACE   Stack_Size    ; provided in command-line option, for example:
                              ; --pd "Stack_Size SETA 512"
__stack_limit
__initial_sp

;******************************************************************************
; Allocate space for the heap.
;
        AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
HeapMem
        SPACE   Heap_Size     ; provided in command-line option, for example:
                              ; --pd "Heap_Size SETA 0"
__heap_limit

; Indicate that the code in this file preserves 8-byte alignment of the stack.
        PRESERVE8

;******************************************************************************
; The vector table.
;
; Place code into the reset code section.
        AREA   RESET, DATA, READONLY, ALIGN=8
        EXPORT  __Vectors
        EXPORT  __Vectors_End
        EXPORT  __Vectors_Size

__Vectors
        DCD     __initial_sp                ; Top of Stack
        DCD     Reset_Handler               ; Reset Handler
        DCD     NMI_Handler                 ; NMI Handler
        DCD     HardFault_Handler           ; Hard Fault Handler
        DCD     MemManage_Handler           ; Memory Manage (MPU) Handler
        DCD     BusFault_Handler            ; Bus Fault Handler
        DCD     UsageFault_Handler          ; Usage Fault Handler
        DCD     SecureFault_Handler         ; Secure Fault Handler
        DCD     Default_Handler             ; Reserved
        DCD     Default_Handler             ; Reserved
        DCD     Default_Handler             ; Reserved
        DCD     SVC_Handler                 ; SVCall handler
        DCD     DebugMon_Handler            ; Debug Monitor handler
        DCD     Default_Handler             ; Reserved
        DCD     PendSV_Handler              ; PendSV handler
        DCD     SysTick_Handler             ; SysTick handler

        ; IRQ handlers...
        DCD     WWDG_IRQHandler             ; [  0]
        DCD     PVD_AVD_IRQHandler          ; [  1]
        DCD     RTC_IRQHandler              ; [  2]
        DCD     RTC_S_IRQHandler            ; [  3]
        DCD     TAMP_IRQHandler             ; [  4]
        DCD     RAMCFG_IRQHandler           ; [  5]
        DCD     FLASH_IRQHandler            ; [  6]
        DCD     FLASH_S_IRQHandler          ; [  7]
        DCD     GTZC_IRQHandler             ; [  8]
        DCD     RCC_IRQHandler              ; [  9]
        DCD     RCC_S_IRQHandler            ; [ 10]
        DCD     EXTI0_IRQHandler            ; [ 11]
        DCD     EXTI1_IRQHandler            ; [ 12]
        DCD     EXTI2_IRQHandler            ; [ 13]
        DCD     EXTI3_IRQHandler            ; [ 14]
        DCD     EXTI4_IRQHandler            ; [ 15]
        DCD     EXTI5_IRQHandler            ; [ 16]
        DCD     EXTI6_IRQHandler            ; [ 17]
        DCD     EXTI7_IRQHandler            ; [ 18]
        DCD     EXTI8_IRQHandler            ; [ 19]
        DCD     EXTI9_IRQHandler            ; [ 20]
        DCD     EXTI10_IRQHandler           ; [ 21]
        DCD     EXTI11_IRQHandler           ; [ 22]
        DCD     EXTI12_IRQHandler           ; [ 23]
        DCD     EXTI13_IRQHandler           ; [ 24]
        DCD     EXTI14_IRQHandler           ; [ 25]
        DCD     EXTI15_IRQHandler           ; [ 26]
        DCD     GPDMA1_Channel0_IRQHandler  ; [ 27]
        DCD     GPDMA1_Channel1_IRQHandler  ; [ 28]
        DCD     GPDMA1_Channel2_IRQHandler  ; [ 29]
        DCD     GPDMA1_Channel3_IRQHandler  ; [ 30]
        DCD     GPDMA1_Channel4_IRQHandler  ; [ 31]
        DCD     GPDMA1_Channel5_IRQHandler  ; [ 32]
        DCD     GPDMA1_Channel6_IRQHandler  ; [ 33]
        DCD     GPDMA1_Channel7_IRQHandler  ; [ 34]
        DCD     IWDG_IRQHandler             ; [ 35]
        DCD     SAES_IRQHandler             ; [ 36]
        DCD     ADC1_IRQHandler             ; [ 37]
        DCD     DAC1_IRQHandler             ; [ 38]
        DCD     FDCAN1_IT0_IRQHandler       ; [ 39]
        DCD     FDCAN1_IT1_IRQHandler       ; [ 40]
        DCD     TIM1_BRK_IRQHandler         ; [ 41]
        DCD     TIM1_UP_IRQHandler          ; [ 42]
        DCD     TIM1_TRG_COM_IRQHandler     ; [ 43]
        DCD     TIM1_CC_IRQHandler          ; [ 44]
        DCD     TIM2_IRQHandler             ; [ 45]
        DCD     TIM3_IRQHandler             ; [ 46]
        DCD     TIM4_IRQHandler             ; [ 47]
        DCD     TIM5_IRQHandler             ; [ 48]
        DCD     TIM6_IRQHandler             ; [ 49]
        DCD     TIM7_IRQHandler             ; [ 50]
        DCD     I2C1_EV_IRQHandler          ; [ 51]
        DCD     I2C1_ER_IRQHandler          ; [ 52]
        DCD     I2C2_EV_IRQHandler          ; [ 53]
        DCD     I2C2_ER_IRQHandler          ; [ 54]
        DCD     SPI1_IRQHandler             ; [ 55]
        DCD     SPI2_IRQHandler             ; [ 56]
        DCD     SPI3_IRQHandler             ; [ 57]
        DCD     USART1_IRQHandler           ; [ 58]
        DCD     USART2_IRQHandler           ; [ 59]
        DCD     USART3_IRQHandler           ; [ 60]
        DCD     UART4_IRQHandler            ; [ 61]
        DCD     UART5_IRQHandler            ; [ 62]
        DCD     LPUART1_IRQHandler          ; [ 63]
        DCD     LPTIM1_IRQHandler           ; [ 64]
        DCD     TIM8_BRK_IRQHandler         ; [ 65]
        DCD     TIM8_UP_IRQHandler          ; [ 66]
        DCD     TIM8_TRG_COM_IRQHandler     ; [ 67]
        DCD     TIM8_CC_IRQHandler          ; [ 68]
        DCD     ADC2_IRQHandler             ; [ 69]
        DCD     LPTIM2_IRQHandler           ; [ 70]
        DCD     TIM15_IRQHandler            ; [ 71]
        DCD     Reserved72_Handler          ; [ 72]
        DCD     Reserved73_Handler          ; [ 73]
        DCD     USB_DRD_FS_IRQHandler       ; [ 74]
        DCD     CRS_IRQHandler              ; [ 75]
        DCD     UCPD1_IRQHandler            ; [ 76]
        DCD     FMC_IRQHandler              ; [ 77]
        DCD     OCTOSPI1_IRQHandler         ; [ 78]
        DCD     SDMMC1_IRQHandler           ; [ 79]
        DCD     I2C3_EV_IRQHandler          ; [ 80]
        DCD     I2C3_ER_IRQHandler          ; [ 81]
        DCD     SPI4_IRQHandler             ; [ 82]
        DCD     Reserved83_Handler          ; [ 83]
        DCD     Reserved84_Handler          ; [ 84]
        DCD     USART6_IRQHandler           ; [ 85]
        DCD     Reserved86_Handler          ; [ 86]
        DCD     Reserved87_Handler          ; [ 87]
        DCD     Reserved88_Handler          ; [ 88]
        DCD     Reserved89_Handler          ; [ 89]
        DCD     GPDMA2_Channel0_IRQHandler  ; [ 90]
        DCD     GPDMA2_Channel1_IRQHandler  ; [ 91]
        DCD     GPDMA2_Channel2_IRQHandler  ; [ 92]
        DCD     GPDMA2_Channel3_IRQHandler  ; [ 93]
        DCD     GPDMA2_Channel4_IRQHandler  ; [ 94]
        DCD     GPDMA2_Channel5_IRQHandler  ; [ 95]
        DCD     GPDMA2_Channel6_IRQHandler  ; [ 96]
        DCD     GPDMA2_Channel7_IRQHandler  ; [ 97]
        DCD     Reserved98_Handler          ; [ 98]
        DCD     Reserved99_Handler          ; [ 99]
        DCD     Reserved100_Handler         ; [100]
        DCD     Reserved101_Handler         ; [101]
        DCD     Reserved102_Handler         ; [102]
        DCD     FPU_IRQHandler              ; [103]
        DCD     ICACHE_IRQHandler           ; [104]
        DCD     DCACHE1_IRQHandler          ; [105]
        DCD     Reserved106_Handler         ; [106]
        DCD     Reserved107_Handler         ; [107]
        DCD     DCMI_PSSI_IRQHandler        ; [108]
        DCD     FDCAN2_IT0_IRQHandler       ; [109]
        DCD     FDCAN2_IT1_IRQHandler       ; [110]
        DCD     Reserved111_Handler         ; [111]
        DCD     Reserved112_Handler         ; [112]
        DCD     DTS_IRQHandler              ; [113]
        DCD     RNG_IRQHandler              ; [114]
        DCD     OTFDEC1_IRQHandler          ; [115]
        DCD     AES_IRQHandler              ; [116]
        DCD     HASH_IRQHandler             ; [117]
        DCD     PKA_IRQHandler              ; [118]
        DCD     CEC_IRQHandler              ; [119]
        DCD     TIM12_IRQHandler            ; [120]
        DCD     Reserved121_Handler         ; [121]
        DCD     Reserved122_Handler         ; [122]
        DCD     I3C1_EV_IRQHandler          ; [123]
        DCD     I3C1_ER_IRQHandler          ; [124]
        DCD     Reserved125_Handler         ; [125]
        DCD     Reserved126_Handler         ; [126]
        DCD     Reserved127_Handler         ; [127]
        DCD     Reserved128_Handler         ; [128]
        DCD     Reserved129_Handler         ; [129]
        DCD     Reserved130_Handler         ; [130]
        DCD     I3C2_EV_IRQHandler          ; [131]
        DCD     I3C2_ER_IRQHandler          ; [132]

__Vectors_End

__Vectors_Size  EQU   __Vectors_End - __Vectors


;******************************************************************************
; This is the code for exception handlers.
;
        AREA    |.text|, CODE, READONLY

;******************************************************************************
; This is the code that gets called when the processor first starts execution
; following a reset event.
;
Reset_Handler   PROC
        EXPORT  Reset_Handler   [WEAK]
        IMPORT  SystemInit
        IMPORT  __main
        IMPORT  assert_failed

